**`teams/nomis/rhel_6_10_baseimage`** terraform plan on `push` event [#468](${url})

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder["rhel_6_10_baseimage"].aws_imagebuilder_component.this["../components/rhel_6_10_baseimage/rhel_6_10_baseimage.yml.tftpl"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/rhel-6-10-baseimage/0.2.1/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: rhel_6_10_baseimage
            description: rhel 6.10 base image component.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: "0.2.1"
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: UpdateOS
                    action: UpdateOS
            
                  - name: InstallPackages
                    action: ExecuteBash
                    inputs:
                      commands:
                        - sudo yum install wget curl unzip git nc ca-certificates gcc screen zlib-devel bzip2-devel openssl-devel ncurses-devel sqlite-devel readline-devel tk-devel gdbm-devel db4-devel xz-devel expat-devel musl-devel libffi-devel xz -y
                        # libpcap-devel is not available in the default yum repos for RHEL 6.10 although it may be available in the EPEL repo.  We don't need it for our purposes so we'll skip it.
            
                  - name: InstallPython
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          cd /tmp
            
                          # download and build Python 3.6.3 
                          sudo wget --no-check-certificate https://python.org/ftp/python/3.6.3/Python-3.6.3.tar.xz
                          tar xf Python-3.6.3.tar.xz
                          sudo rm -f Python-3.6.3.tar.xz
                          cd Python-3.6.3/
                          ./configure --enable-optimizations
                          sudo make altinstall
            
                  # Install pip for Python 3.6.3
                  - name: InstallPipAndVirtualenv
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          cd /tmp
            
                          # install pip and virtualenv
                          sudo wget https://bootstrap.pypa.io/pip/3.6/get-pip.py
                          python3.6 get-pip.py
                          python3.6 -m pip install --upgrade pip
                          python3.6 -m pip install virtualenv
            
                  # Install node exporter agent with ansible-core (2.11.12)
                  - name: InstallAnsible
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          cd /tmp
                  
                          # install ansible and create virtualenv
                          
                          mkdir /tmp/python-venv && cd "$_"
                          python3.6 -m venv ansible
                          source ansible/bin/activate
            
                          # install ansible modules in virtual env
                          pip install --upgrade pip
                          python3.6 -m pip install wheel
                          python3.6 -m pip install cryptography==2.3
                          export LC_ALL=en_US.UTF-8
                          python3.6 -m pip install ansible-core==2.11.12
            
                          # download playbook
                          mkdir /tmp/node-exporter-ansible-playbook && cd "$_"
          -               echo "Cloning using branch=nomis/DSOS-1437/weblogic-ansible-refactor"
          -               git clone -b nomis/DSOS-1437/weblogic-ansible-refactor "https://github.com/ministryofjustice/modernisation-platform-ami-builds.git"
          +               echo "Cloning using branch=main"
          +               git clone -b main "https://github.com/ministryofjustice/modernisation-platform-ami-builds.git"
                          cd modernisation-platform-ami-builds/ansible
            
                          # install requirements in virtual env
                          python3.6 -m pip install -r requirements.txt
                          ansible-galaxy role install -r requirements.yml
                          ansible-galaxy collection install -r requirements.yml
            
                          # Get required extra vars and run ansible
                          PY_INTERPRETER=$(which python3.6)
                          ansible-playbook ../teams/nomis/ansible/playbooks/node-exporter-install.yml \
                          --connection=local \
                          --inventory localhost \
                          --extra-vars "ansible_python_interpreter=$PY_INTERPRETER" \
                          --become
            
                          # Deactivate virtual env and cleanup
                          deactivate
                          rm -rf /tmp/python-venv
                          rm -rf /tmp/node-exporter-ansible-playbook
        EOT
      ~ date_created          = "2022-09-21T10:04:59.179Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/rhel-6-10-baseimage/0.2.1/1" -> (known after apply)
        name                  = "rhel_6_10_baseimage"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "branch"                       = "nomis/DSOS-1437/weblogic-ansible-refactor" -> "main"
          ~ "is-production"                = "false" -> "true"
            # (11 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "branch"                       = "nomis/DSOS-1437/weblogic-ansible-refactor" -> "main"
          ~ "is-production"                = "false" -> "true"
            # (11 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.imagebuilder["rhel_6_10_baseimage"].aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-rhel-6-10-baseimage"
        name         = "nomis_rhel_6_10_baseimage"
      ~ tags         = {
          ~ "branch"                       = "nomis/DSOS-1437/weblogic-ansible-refactor" -> "main"
          ~ "is-production"                = "false" -> "true"
            # (11 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "branch"                       = "nomis/DSOS-1437/weblogic-ansible-refactor" -> "main"
          ~ "is-production"                = "false" -> "true"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder["rhel_6_10_baseimage"].aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-rhel-6-10-baseimage" -> (known after apply)
      ~ date_created                     = "2022-09-21T10:05:03.751Z" -> (known after apply)
      ~ date_last_run                    = "2022-09-21T10:05:20.871Z" -> (known after apply)
      ~ date_next_run                    = "2022-10-01T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2022-09-21T10:05:03.751Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-rhel-6-10-baseimage" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-6-10-baseimage/0.2.5" -> (known after apply) # forces replacement
        name                             = "nomis_rhel_6_10_baseimage"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
          ~ "branch"                       = "nomis/DSOS-1437/weblogic-ansible-refactor" -> "main"
          ~ "is-production"                = "false" -> "true"
            # (11 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "branch"                       = "nomis/DSOS-1437/weblogic-ansible-refactor" -> "main"
          ~ "is-production"                = "false" -> "true"
            # (11 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)


      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.imagebuilder["rhel_6_10_baseimage"].aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-6-10-baseimage/0.2.5" -> (known after apply)
      ~ date_created     = "2022-09-21T10:05:01.873Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-6-10-baseimage/0.2.5" -> (known after apply)
        name             = "nomis_rhel_6_10_baseimage"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Linux" -> (known after apply)
      ~ tags             = {
          ~ "branch"                       = "nomis/DSOS-1437/weblogic-ansible-refactor" -> "main"
          ~ "is-production"                = "false" -> "true"
            # (11 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "branch"                       = "nomis/DSOS-1437/weblogic-ansible-refactor" -> "main"
          ~ "is-production"                = "false" -> "true"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/rhel-6-10-baseimage/0.2.1/1" -> (known after apply) # forces replacement
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder["rhel_6_10_baseimage"].aws_imagebuilder_infrastructure_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_infrastructure_configuration" "this" {
        id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-6-10-baseimage-0-2-5"
        name                          = "nomis_rhel_6_10_baseimage_0_2_5"
      ~ resource_tags                 = {
          ~ "branch"                       = "nomis/DSOS-1437/weblogic-ansible-refactor" -> "main"
          ~ "is-production"                = "false" -> "true"
            # (11 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "branch"                       = "nomis/DSOS-1437/weblogic-ansible-refactor" -> "main"
          ~ "is-production"                = "false" -> "true"
            # (11 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "branch"                       = "nomis/DSOS-1437/weblogic-ansible-refactor" -> "main"
          ~ "is-production"                = "false" -> "true"
            # (11 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on ../modules/imagebuilder/versions.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

```